In [2]:
%load_ext sql

In [3]:
# Connecting to Database
%sql postgresql://postgres:postgres@localhost/instagrammers

In [4]:
# This script gives able to display results of SQL queries
from prettytable import PrettyTable, PLAIN_COLUMNS
table = PrettyTable()
table.set_style(PLAIN_COLUMNS)

%config SqlMagic.style = 'PLAIN_COLUMNS'

/var/folders/m4/txcpxbmd1096vr9sz2ccybqr0000gn/T/ipykernel_23311/2727922173.py:2: DeprecationWarning: the 'PLAIN_COLUMNS' constant is deprecated, use the 'TableStyle' enum instead
  from prettytable import PrettyTable, PLAIN_COLUMNS

In [ ]:
%%sql
CREATE TABLE instagrammers(
    name VARCHAR(100),
    rank INT,
    category VARCHAR(255),
    followers INT,
    audience_country VARCHAR(50),
    authentic_engagement NUMERIC,
    avg_engagement NUMERIC
);

 * postgresql://postgres:***@localhost/instagrammers
Done.
Done.

[]

```
Import data to table by terminal!

(base) bartlomiejpodstawek@192 ~ % psql -U postgres -d instagrammers
Password for user postgres: 
psql (17.4 (Homebrew), server 17.2)
Type "help" for help.

instagrammers=# \copy public.instagrammers (name, rank, category, followers, audience_country, authentic_engagement, avg_engagement) 
FROM '/Users/bartlomiejpodstawek/Desktop/top_1000_instagrammers.csv' 
DELIMITER ';' CSV HEADER ENCODING 'UTF8' QUOTE '"';
COPY 1000
```

In [ ]:
%%sql

-- Overview Data
SELECT * FROM instagrammers LIMIT 5;

 * postgresql://postgres:***@localhost/instagrammers
5 rows affected.

[('cristiano', 1, 'Sports with a ball', 462900000, 'India', Decimal('5500000'), Decimal('6600000')),
 ('leomessi', 2, 'Sports with a ballFamily', 347200000, 'Argentina', Decimal('3600000'), Decimal('4800000')),
 ('kendalljenner', 3, 'ModelingFashion', 247600000, 'United States', Decimal('3000000'), Decimal('4900000')),
 ('arianagrande', 4, 'Music', 321400000, 'United States', Decimal('2400000'), Decimal('3400000')),
 ('zendaya', 5, 'Cinema & Actors/actressesFashion', 147000000, 'United States', Decimal('4300000'), Decimal('5800000'))]

In [ ]:
%%sql

-- Count the total number of records (or rows) are in the SQL view

SELECT
    COUNT(*) AS no_of_rows
FROM
    instagrammers;

 * postgresql://postgres:***@localhost/instagrammers
1 rows affected.

[(1000,)]

In [ ]:
%%sql

-- Count the total number of columns (or fields) are in the SQL view

SELECT
    COUNT(*) AS column_count
FROM
    information_schema.columns
WHERE
    table_name = 'instagrammers'
    AND table_schema = 'public';

 * postgresql://postgres:***@localhost/instagrammers
1 rows affected.

[(7,)]

In [ ]:
%%sql

-- Check the data types of each column from the view by checking the INFORMATION SCHEMA view

SELECT
    column_name,
    data_type
FROM
    information_schema.columns
WHERE
    table_name = 'instagrammers';

 * postgresql://postgres:***@localhost/instagrammers
7 rows affected.

[('followers', 'integer'),
 ('rank', 'integer'),
 ('authentic_engagement', 'numeric'),
 ('avg_engagement', 'numeric'),
 ('audience_country', 'character varying'),
 ('category', 'character varying'),
 ('name', 'character varying')]

In [66]:
%%sql

-- Check missing values

SELECT 
    SUM(CASE WHEN name IS NULL OR name = '' THEN 1 ELSE 0 END) AS missing_name,
    SUM(CASE WHEN rank IS NULL THEN 1 ELSE 0 END) AS missing_rank,
    SUM(CASE WHEN category IS NULL OR category = '' THEN 1 ELSE 0 END) AS missing_category,
    SUM(CASE WHEN followers IS NULL THEN 1 ELSE 0 END) AS missing_followers,
    SUM(CASE WHEN audience_country IS NULL OR audience_country = '' THEN 1 ELSE 0 END) AS missing_audience_country,
    SUM(CASE WHEN authentic_engagement IS NULL THEN 1 ELSE 0 END) AS missing_authentic_engagement,
    SUM(CASE WHEN avg_engagement IS NULL THEN 1 ELSE 0 END) AS missing_avg_engagement
FROM instagrammers;

 * postgresql://postgres:***@localhost/instagrammers
1 rows affected.

[(0, 0, 84, 0, 14, 0, 0)]

In [ ]:
%%sql
-- Check duplicates values count

SELECT 
	COUNT(*) - COUNT(distinct name) as total_duplicates
FROM 
    instagrammers;

 * postgresql://postgres:***@localhost/instagrammers
1 rows affected.

[(38,)]

In [ ]:
%%sql

-- Check the count of rows cleaned data

WITH no_duplicates AS (
    SELECT
        *,
        ROW_NUMBER() OVER (
            PARTITION BY name
            ORDER BY rank
        ) AS rn
    FROM instagrammers
    WHERE
        -- Exclude NULL or empty values in text columns
        name IS NOT NULL AND name <> ''
        AND category IS NOT NULL AND category <> ''
        AND audience_country IS NOT NULL AND audience_country <> ''

        -- Exclude NULL or zero values in numeric columns
        AND rank IS NOT NULL
        AND followers IS NOT NULL AND followers > 0
        AND authentic_engagement IS NOT NULL AND authentic_engagement > 0
)
SELECT COUNT(*)
FROM no_duplicates
WHERE rn = 1;

 * postgresql://postgres:***@localhost/instagrammers
1 rows affected.

[(875,)]

In [ ]:
%%sql

-- Create view as Filtered Table with no duplicates and any missing values limited to 50 rows in descending order.

drop view top_50;

CREATE VIEW top_50 AS
WITH cleaned_data AS (
    SELECT 
        *,
        ROW_NUMBER() OVER (
            PARTITION BY name
            ORDER BY rank
        ) AS rn
    FROM instagrammers
    WHERE
        -- Exclude NULL or empty values in text columns
        name IS NOT NULL AND name <> ''
        AND category IS NOT NULL AND category <> ''
        AND audience_country IS NOT NULL AND audience_country <> ''
        
        -- Exclude NULL or zero values in numeric columns
        AND rank IS NOT NULL
        AND followers IS NOT NULL AND followers > 0
        AND authentic_engagement IS NOT NULL AND authentic_engagement > 0
)
SELECT
    name,
    category,
    followers,
    audience_country,
    authentic_engagement
FROM clean_data
WHERE
    -- Keep only the first occurrence for each 'name' (lowest rank)
    rn = 1
    
    -- Filter by 'United States' only
    AND audience_country = 'United States'
    
    -- Filter categories containing 'Lifestyle' 'Fashion' or 'Modeling'
    AND (
        category LIKE '%Lifestyle%' 
        OR category LIKE '%Fashion%'
        OR category LIKE '%Modeling%'
    )
ORDER BY 
    authentic_engagement DESC
LIMIT 50;

 * postgresql://postgres:***@localhost/instagrammers
Done.
Done.

[]

In [ ]:
%%sql

-- load data from view

SELECT * FROM top_50;

 * postgresql://postgres:***@localhost/instagrammers
50 rows affected.

[('zendaya', 'Cinema & Actors/actressesFashion', 147000000, 'United States', Decimal('4300000')),
 ('kendalljenner', 'ModelingFashion', 247600000, 'United States', Decimal('3000000')),
 ('harrystyles', 'MusicFashion', 46300000, 'United States', Decimal('2100000')),
 ('kimkardashian', 'FashionBeauty', 323600000, 'United States', Decimal('1700000')),
 ('gigihadid', 'ModelingLifestyle', 74900000, 'United States', Decimal('1600000')),
 ('selenagomez', 'MusicLifestyle', 334900000, 'United States', Decimal('1400000')),
 ('kyliejenner', 'FashionModelingBeauty', 357000000, 'United States', Decimal('1200000')),
 ('charlidamelio', 'LifestyleShows', 48900000, 'United States', Decimal('1200000')),
 ('khloekardashian', 'Clothing & OutfitsLifestyle', 260400000, 'United States', Decimal('1100000')),
 ('iamcardib', 'MusicFashion', 137300000, 'United States', Decimal('1100000')),
 ('lanarhoades', 'LifestyleModeling', 16800000, 'United States', Decimal('1000000')),
 ('beyonce', 'MusicFashion', 267400000, 'United States', Decimal('949900')),
 ('sydney_sweeney', 'LifestyleCinema & Actors/actresses', 13600000, 'United States', Decimal('923900')),
 ('emmachamberlain', 'LifestyleShows', 15900000, 'United States', Decimal('873500')),
 ('anguscloud', 'LifestyleMusic', 8200000, 'United States', Decimal('831000')),
 ('kourtneykardash', 'Lifestyle', 189000000, 'United States', Decimal('739800')),
 ('vinniehacker', 'Lifestyle', 5800000, 'United States', Decimal('695700')),
 ('haileybieber', 'LifestyleModeling', 45900000, 'United States', Decimal('655900')),
 ('barbieferreira', 'LifestyleMusicCinema & Actors/actresses', 6300000, 'United States', Decimal('620000')),
 ('ana_d_armas', 'Cinema & Actors/actressesLifestyle', 7100000, 'United States', Decimal('616300')),
 ('emrata', 'Modeling', 29500000, 'United States', Decimal('606100')),
 ('itsmarziapie', 'BeautyLifestyle', 8300000, 'United States', Decimal('574900')),
 ('sav.labrant', 'FamilyLifestyleShows', 7100000, 'United States', Decimal('556400')),
 ('jennaortega', 'Cinema & Actors/actressesLifestyle', 8200000, 'United States', Decimal('538900')),
 ('mathildtantot', 'LifestyleModeling', 10200000, 'United States', Decimal('533100')),
 ('travisbarker', 'Lifestyle', 7600000, 'United States', Decimal('521800')),
 ('bellapoarch', 'LifestyleMusic', 14100000, 'United States', Decimal('502100')),
 ('bellahadid', 'Modeling', 53200000, 'United States', Decimal('499700')),
 ('hannahstocking', 'Modeling', 22100000, 'United States', Decimal('493500')),
 ('therealcalebmclaughlin', 'Cinema & Actors/actressesLifestyle', 14200000, 'United States', Decimal('493300')),
 ('hshq', 'MusicCinema & Actors/actressesFashion', 6300000, 'United States', Decimal('488200')),
 ('nessabarrett', 'LifestyleMusic', 7000000, 'United States', Decimal('481000')),
 ('maudeapatow', 'LifestyleCinema & Actors/actresses', 4900000, 'United States', Decimal('471400')),
 ('pokimanelol', 'LifestyleShowsComputers & Gadgets', 6100000, 'United States', Decimal('430600')),
 ('phoebejtonkin', 'BeautyCinema & Actors/actressesModeling', 8400000, 'United States', Decimal('373000')),
 ('onwardwanna', 'LifestyleCinema & Actors/actresses', 5600000, 'United States', Decimal('364700')),
 ('madisonbaileybabe', 'Lifestyle', 6700000, 'United States', Decimal('362400')),
 ('jackharlow', 'LifestyleMusic', 6700000, 'United States', Decimal('360700')),
 ('polo.capalot', 'MusicLifestyle', 10500000, 'United States', Decimal('335500')),
 ('natalee.007', 'ModelingMusic', 7000000, 'United States', Decimal('328000')),
 ('easymoneysniper', 'LifestyleSports with a ball', 13100000, 'United States', Decimal('325400')),
 ('cole.labrant', 'LifestyleFashion', 5100000, 'United States', Decimal('310900')),
 ('demirose', 'ModelingLifestyleFashion', 19900000, 'United States', Decimal('305400')),
 ('colesprouse', 'Modeling', 36000000, 'United States', Decimal('292100')),
 ('jailyneojeda', 'ModelingLifestyle', 14200000, 'United States', Decimal('280500')),
 ('larray', 'LifestyleModelingFashion', 6800000, 'United States', Decimal('277600')),
 ('normani', 'Lifestyle', 7300000, 'United States', Decimal('271100')),
 ('liltjay', 'LifestyleMusic', 7400000, 'United States', Decimal('251600')),
 ('shaymitchell', 'BeautyFamilyLifestyle', 33800000, 'United States', Decimal('234100')),
 ('indiaroyale', 'Lifestyle', 4300000, 'United States', Decimal('232100'))]